# Análise dos Microdados Enem 2022

In [1]:
import pandas as pd
import chardet
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

### Importando Dados

In [3]:
dados = pd.read_csv('data/MICRODADOS_ENEM_2022.csv', encoding='cp1252', sep=';')

In [4]:
dados.head(4)

,NU_INSCRICAO,NU_ANO,TP_FAIXA_ETARIA,TP_SEXO,TP_ESTADO_CIVIL,TP_COR_RACA,TP_NACIONALIDADE,TP_ST_CONCLUSAO,TP_ANO_CONCLUIU,TP_ESCOLA,...,Q016,Q017,Q018,Q019,Q020,Q021,Q022,Q023,Q024,Q025
0,210057943671,2022,14,M,2,2,1,1,2,1,...,B,A,A,A,A,A,A,A,A,A
1,210057516120,2022,14,M,2,1,1,1,16,1,...,E,E,B,E,B,B,E,B,E,B
2,210057280536,2022,5,F,1,2,1,1,2,1,...,A,A,A,A,A,A,C,A,A,B
3,210055724397,2022,6,M,1,3,1,1,2,1,...,B,A,A,C,A,A,C,B,B,B

#### Quantidade Total de participantes, Total Feminino e Total Masculino

In [5]:
masc = dados['TP_SEXO'] == 'M'
fem = dados['TP_SEXO'] == 'F'
m = dados[masc].shape[0]
f = dados[fem].shape[0]

In [6]:
f

2120519

In [7]:
m

1355586

In [8]:
f + m == dados.shape[0]

True

#### Separando em um DF as colunas de Sexo e Notas por área do conhecimento

In [14]:
df_sexo_notas = dados.loc[:, ['TP_SEXO', 'NU_NOTA_CN', 'NU_NOTA_CH', 'NU_NOTA_LC', 'NU_NOTA_MT']]

#### Removendo os dados NA

In [15]:
df_sexo_notas = df_sexo_notas.dropna()
df_sexo_notas.head(15)

   TP_SEXO  NU_NOTA_CN  NU_NOTA_CH  NU_NOTA_LC  NU_NOTA_MT
2        F       421.1       546.0       498.8       565.3
3        M       490.7       388.6       357.8       416.0
7        F       398.1       427.3       400.2       404.9
9        F       467.5       461.0       466.7       435.3
11       F       458.7       539.8       488.2       456.8
17       F       396.8       528.7       551.4       536.0
18       F       481.4       603.6       589.0       695.0
20       F       466.5       476.2       488.3       462.7
22       F       493.8       498.2       527.0       343.0
23       M       476.0       559.2       607.3       625.4
25       M       386.5       458.5       479.7       383.1
27       M       414.6       518.2       596.5       573.4
29       F       437.0       505.2       438.6       615.3
30       F       576.5       590.6       601.4       744.6
31       M       385.5       415.9       415.6       352.4

### Total de Faltantes

In [18]:
total_faltantes = dados.shape[0] - df_sexo_notas.shape[0]
total_faltantes

1131282

#### Faltantes em Porcentagem

In [20]:
total_faltantes_porcentagem = (total_faltantes / dados.shape[0]) * 100
total_faltantes_porcentagem

32.544529005884456

##### Média notas separadas por sexo

In [40]:
media_por_materia_sexo = df_sexo_notas.groupby('TP_SEXO').mean()
media_por_materia_sexo

         NU_NOTA_CN  NU_NOTA_CH  NU_NOTA_LC  NU_NOTA_MT
TP_SEXO
F        488.478663  525.790145  519.092356  526.702268
M        507.941966  536.578920  521.117842  567.778466

In [ ]:
media_por_materia_sexo = df_sexo_notas.groupby('TP_SEXO').mean()
media_por_materia_sexo